DataProcessors/ЖурналДокументовИнтеркампани.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ЖурналДокументовИнтеркампани</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыКОформлениюОтчетовКомитенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКОформлениюОтчетовКомитенту</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВыручки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСписано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВыручкиКОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСписаноКОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотреблениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыПереданныеНаКомиссию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыПереданныеНаКомиссию</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СуммаВыручки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/УслугиКОформлениюОтчетовПринципалу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>УслугиКОформлениюОтчетовПринципалу</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВыручки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СуммаВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ЖурналДокументовИнтеркампани/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет состав документов и хозяйственных операций, доступных для отображения в рабочем месте
//
// Параметры:
//  ХозяйственныеОперацииИДокументы	 - ТаблицаЗначений - таблица значений с колонками:
//     * ХозяйственнаяОперация					 - ПеречислениеСсылка.ХозяйственныеОперации
//     * ИдентификаторОбъектаМетаданных			 - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//     * Отбор									 - Булево
//     * ДокументПредставление					 - Строка
//     * ПолноеИмяДокумента						 - Строка
//     * Накладная								 - Булево
//     * ИспользуетсяРаспоряжение				 - Булево
//     * ИспользуютсяСтатусы					 - Булево
//     * ПоНесколькимЗаказам					 - Булево
//     * ПриходныйОрдерНевозможен				 - Булево
//     * РазделятьДокументыПоПодразделению		 - Булево
//     * ПолноеИмяНакладной						 - Строка
//     * КлючНазначенияИспользования			 - Строка
//     * ПравоДоступаДобавление					 - Булево
//     * ПравоДоступаИзменение					 - Булево
//     * ЗаголовокРабочегоМеста					 - Строка
//     * ИменаЭлементовСУправляемойВидимостью	 - Строка
//     * ИменаЭлементовРабочегоМеста			 - Строка
//     * ИменаОтображаемыхЭлементов				 - Строка
//     * МенеджерРасчетаГиперссылкиКОформлению	 - Строка
//  ОтборХозяйственныеОперации		 - СписокЗначений - список значений типа ПеречислениеСсылка.ХозяйственныеОперации
//  ОтборТипыДокументов				 - СписокЗначений - список значений типа СправочникСсылка.ИдентификаторыОбъектовМетаданных
//  КлючНазначенияИспользования		 - Строка - ключ рабочего места для которого вызывается функция
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - таблица значений с колонками:
//     * ХозяйственнаяОперация					 - ПеречислениеСсылка.ХозяйственныеОперации
//     * ИдентификаторОбъектаМетаданных			 - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//     * Отбор									 - Булево
//     * ДокументПредставление					 - Строка
//     * ПолноеИмяДокумента						 - Строка
//     * Накладная								 - Булево
//     * ИспользуетсяРаспоряжение				 - Булево
//     * ИспользуютсяСтатусы					 - Булево
//     * ПоНесколькимЗаказам					 - Булево
//     * ПриходныйОрдерНевозможен				 - Булево
//     * РазделятьДокументыПоПодразделению		 - Булево
//     * ПолноеИмяНакладной						 - Строка
//     * КлючНазначенияИспользования			 - Строка
//     * ПравоДоступаДобавление					 - Булево
//     * ПравоДоступаИзменение					 - Булево
//     * ЗаголовокРабочегоМеста					 - Строка
//     * ИменаЭлементовСУправляемойВидимостью	 - Строка
//     * ИменаЭлементовРабочегоМеста			 - Строка
//     * ИменаОтображаемыхЭлементов				 - Строка
//     * МенеджерРасчетаГиперссылкиКОформлению	 - Строка
//
Функция ИнициализироватьХозяйственныеОперацииИДокументы(ХозяйственныеОперацииИДокументы, ОтборХозяйственныеОперации,
		ОтборТипыДокументов, КлючНазначенияИспользования) Экспорт
	
	// ВозвратТоваровМеждуОрганизациями
	
	СтрокаВозвратТоваровМеждуОрганизациями = ХозяйственныеОперацииИДокументы.Добавить();
	
	Строка = СтрокаВозвратТоваровМеждуОрганизациями;
	Строка.КлючНазначенияИспользования = "ВозвратТоваровМеждуОрганизациями";
	Строка.ХозяйственнаяОперация       = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями;
	Строка.ДобавитьКнопкуСоздать       = Истина;
	Строка.ПолноеИмяДокумента          = "Документ.ВозвратТоваровМеждуОрганизациями";
	Строка.ЗаголовокРабочегоМеста      = НСтр("ru = 'Документы между организациями (возвраты)'");
	
	Строка = ХозяйственныеОперацииИДокументы.Добавить();
	ЗаполнитьЗначенияСвойств(Строка, СтрокаВозвратТоваровМеждуОрганизациями);
	Строка.ХозяйственнаяОперация       = Перечисления.ХозяйственныеОперации.ВозвратПоКомиссииМеждуОрганизациями;
	
	// ОтчетПоКомиссииМеждуОрганизациями
	
	СтрокаОтчетПоКомиссииМеждуОрганизациями = ХозяйственныеОперацииИДокументы.Добавить();
	
	Строка = СтрокаОтчетПоКомиссииМеждуОрганизациями;
	Строка.КлючНазначенияИспользования = "ОтчетПоКомиссииМеждуОрганизациями";
	Строка.ХозяйственнаяОперация       = Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями;
	Строка.ДобавитьКнопкуСоздать       = Истина;
	Строка.ПолноеИмяДокумента          = "Документ.ОтчетПоКомиссииМеждуОрганизациями";
	Строка.ЗаголовокРабочегоМеста      = НСтр("ru = 'Документы между организациями (отчеты по комиссии)'");
	Строка.МенеджерРасчетаГиперссылкиКОформлению = "Обработка.ЖурналДокументовИнтеркампани";
	
	// ОтчетПоКомиссииМеждуОрганизациямиОСписании
	
	СтрокаОтчетПоКомиссииМеждуОрганизациямиОСписании = ХозяйственныеОперацииИДокументы.Добавить();
	
	Строка = СтрокаОтчетПоКомиссииМеждуОрганизациямиОСписании;
	Строка.КлючНазначенияИспользования = "ОтчетПоКомиссииМеждуОрганизациями";
	Строка.ХозяйственнаяОперация       = Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациямиОСписании;
	Строка.ДобавитьКнопкуСоздать       = Истина;
	Строка.ПолноеИмяДокумента          = "Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании";
	Строка.ЗаголовокРабочегоМеста      = НСтр("ru = 'Документы между организациями (отчеты по комиссии о списании)'");
	Строка.МенеджерРасчетаГиперссылкиКОформлению = "Обработка.ЖурналДокументовИнтеркампани";
	
	// ПередачаТоваровМеждуОрганизациями
	
	СтрокаПередачаТоваровМеждуОрганизациями = ХозяйственныеОперацииИДокументы.Добавить();
	
	Строка = СтрокаПередачаТоваровМеждуОрганизациями;
	Строка.КлючНазначенияИспользования = "ПередачаТоваровМеждуОрганизациями";
	Строка.ХозяйственнаяОперация       = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию;
	Строка.ДобавитьКнопкуСоздать       = Истина;
	Строка.ПолноеИмяДокумента          = "Документ.ПередачаТоваровМеждуОрганизациями";
	Строка.ЗаголовокРабочегоМеста      = НСтр("ru = 'Документы между организациями (передачи)'");
	Строка.МенеджерРасчетаГиперссылкиКОформлению = "Документ.ПередачаТоваровМеждуОрганизациями";
	
	Строка = ХозяйственныеОперацииИДокументы.Добавить();
	ЗаполнитьЗначенияСвойств(Строка, СтрокаПередачаТоваровМеждуОрганизациями);
	Строка.ХозяйственнаяОперация       = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию;
	
	Если КлючНазначенияИспользования = "ДокументыИнтеркампани" Тогда
		КлючНастроек = "";
	Иначе
		КлючНастроек = КлючНазначенияИспользования;
	КонецЕсли;
	
	ТаблицаЗначенийДоступно = ОбщегоНазначенияУТ.ДоступныеХозяйственныеОперацииИДокументы(ХозяйственныеОперацииИДокументы,
		ОтборХозяйственныеОперации, ОтборТипыДокументов, КлючНастроек);
	
	Возврат ТаблицаЗначенийДоступно;
	
КонецФункции

#Область ФормированиеГиперссылкиВЖурналеДокументовЗакупки

// Возвращает текст запроса, который используется для получения данных об оформляемых отчетах
// по комиссиям между организациями.
//
// Параметры;
//	ПараметрыЗапроса - Структура - параметры запроса.
//
// ВозвращаемоеЗначение:
//	Строка - текст запроса, который используется для получения данных об оформляемых отчетах
//		по комиссиям между организациями.
//
Функция ТекстЗапросаОформляемыеОтчетыПоКомиссии(ПараметрыЗапроса) Экспорт
	
	ТекстЗапросаВременнтыхТаблиц   = "";
	ТекстЗапросаТоваровКОформлению = "";
	
	ТекстОбъединить = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	ТекстРазделить  = "
		|;
		|
		|//////////////////////////////////////////////////
		|";
	
	ЕстьПравоЧтенияТоваровКОформлению = ПравоДоступа(
		"Чтение", Метаданные.РегистрыНакопления.ТоварыКОформлениюОтчетовКомитенту);
	ЕстьПравоЧтенияТоваровПереданных  = ПравоДоступа(
		"Чтение", Метаданные.РегистрыНакопления.ТоварыПереданныеНаКомиссию);
	ЕстьПравоЧтенияУслугКОформлению   = ПравоДоступа(
		"Чтение", Метаданные.РегистрыНакопления.УслугиКОформлениюОтчетовПринципалу);
	
	Если ПараметрыЗапроса.ОформитьПоОтчетамКомиссии
		И ЕстьПравоЧтенияТоваровКОформлению
		И ЕстьПравоЧтенияТоваровПереданных Тогда
		
		ТекстЗапросаВременнтыхТаблиц = ТекстЗапросаВременнтыхТаблиц + "
		|ВЫБРАТЬ
		|	ТоварыКомитенту.Валюта                                    КАК Валюта,
		|	ТоварыКомитенту.ВидЗапасов                                КАК ВидЗапасов,
		|	ТоварыКомитенту.ВидЗапасов.Организация                    КАК Комиссионер,
		|	ТоварыКомитенту.ВидЗапасов.ВладелецТовара                 КАК Комитент,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры                КАК АналитикаУчетаНоменклатуры,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Номенклатура   КАК Номенклатура,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Назначение     КАК Назначение,
		|	СУММА(ТоварыКомитенту.КоличествоОстаток)                  КАК Остаток
		|ПОМЕСТИТЬ ТоварыКомитентуНаКонецПериода
		|ИЗ
		|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Остатки(&КонГраница,
		|		ВидЗапасов.ВладелецТовара ССЫЛКА Справочник.Организации
		|		//&УсловиеОтбора1
		|	) КАК ТоварыКомитенту
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКомитенту.Валюта,
		|	ТоварыКомитенту.ВидЗапасов,
		|	ТоварыКомитенту.ВидЗапасов.Организация,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Характеристика,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Назначение
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыКомитенту.КоличествоОстаток) <> 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Комиссионер,
		|	Комитент,
		|	Номенклатура,
		|	Характеристика,
		|	Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Склад          КАК Комиссионер,
		|	ТоварыПереданные.ВидЗапасов.Организация                    КАК Комитент,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры                КАК АналитикаУчетаНоменклатуры,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Номенклатура   КАК Номенклатура,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Назначение     КАК Назначение,
		|	СУММА(ТоварыПереданные.КоличествоОстаток)                  КАК Остаток
		|ПОМЕСТИТЬ ТоварыПереданныеНаКонецПериода
		|ИЗ
		|	РегистрНакопления.ТоварыПереданныеНаКомиссию.Остатки(&КонГраница,
		|		АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.Организации
		|		//&УсловиеОтбора2
		|	) КАК ТоварыПереданные
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Склад,
		|	ТоварыПереданные.ВидЗапасов.Организация,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Характеристика,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Назначение
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыПереданные.КоличествоОстаток) <> 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Комиссионер,
		|	Комитент,
		|	Номенклатура,
		|	Характеристика,
		|	Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		
		ТекстЗапросаТоваровКОформлению = ТекстЗапросаТоваровКОформлению + "
		|ВЫБРАТЬ //&КоличествоЗаписей
		|	ТоварыКомитенту.Валюта                     КАК Валюта,
		|	ТоварыКомитенту.Комиссионер                КАК Комиссионер,
		|	ТоварыКомитенту.Комитент                   КАК Комитент,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТоварыКомитенту.ВидЗапасов                 КАК ВидЗапасов,
		|	ВЫБОР
		|		КОГДА ТоварыКомитенту.Остаток <= ТоварыПереданные.Остаток
		|			ТОГДА ТоварыКомитенту.Остаток
		|		КОГДА ТоварыКомитенту.Остаток > ТоварыПереданные.Остаток
		|			ТОГДА ТоварыПереданные.Остаток
		|	КОНЕЦ                                      КАК Остаток,
		|	0                                          КАК Списано,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями) КАК ХозяйственнаяОперация
		|ИЗ
		|	ТоварыКомитентуНаКонецПериода КАК ТоварыКомитенту
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыПереданныеНаКонецПериода КАК ТоварыПереданные
		|		ПО ТоварыКомитенту.Комиссионер = ТоварыПереданные.Комиссионер
		|			И ТоварыКомитенту.Комитент = ТоварыПереданные.Комитент
		|			И ТоварыКомитенту.Номенклатура = ТоварыПереданные.Номенклатура
		|			И ТоварыКомитенту.Характеристика = ТоварыПереданные.Характеристика
		|			И ТоварыКомитенту.Назначение = ТоварыПереданные.Назначение
		|
		|ГДЕ
		|	ВЫБОР
		|		КОГДА ТоварыКомитенту.Остаток <= ТоварыПереданные.Остаток
		|			ТОГДА ТоварыКомитенту.Остаток
		|		КОГДА ТоварыКомитенту.Остаток > ТоварыПереданные.Остаток
		|			ТОГДА ТоварыПереданные.Остаток
		|	КОНЕЦ <> 0
		|";
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ОформитьПоОтчетамКомиссии
		И ЕстьПравоЧтенияУслугКОформлению Тогда
		
		ТекстЗапросаТоваровКОформлению = ?(ЗначениеЗаполнено(ТекстЗапросаТоваровКОформлению),
										ТекстЗапросаТоваровКОформлению + ТекстОбъединить,
										ТекстЗапросаТоваровКОформлению);
		
		ТекстЗапросаТоваровКОформлению = ТекстЗапросаТоваровКОформлению + "
		|ВЫБРАТЬ //&КоличествоЗаписей
		|	УслугиКОформлению.Валюта                           КАК Валюта,
		|	УслугиКОформлению.Организация                      КАК Комиссионер,
		|	УслугиКОформлению.АналитикаУчетаНоменклатуры.Склад КАК Комитент,
		|	УслугиКОформлению.АналитикаУчетаНоменклатуры       КАК АналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)      КАК ВидЗапасов,
		|	УслугиКОформлению.КоличествоОстаток                КАК Остаток,
		|	0                                                  КАК Списано,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями) КАК ХозяйственнаяОперация
		|ИЗ
		|	РегистрНакопления.УслугиКОформлениюОтчетовПринципалу.Остатки(&КонГраница,
		|		АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.Организации
		|		//&УсловиеОтбора3
		|	) КАК УслугиКОформлению
		|ГДЕ
		|	УслугиКОформлению.КоличествоОстаток <> 0";
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ОтобратьПоОтчетамКомиссииОСписании
		И ЕстьПравоЧтенияТоваровКОформлению
		И ЕстьПравоЧтенияТоваровПереданных Тогда
		
		ТекстЗапросаВременнтыхТаблиц = ТекстЗапросаВременнтыхТаблиц + "
		|ВЫБРАТЬ
		|	ТоварыКомитенту.Валюта                                    КАК Валюта,
		|	ТоварыКомитенту.ВидЗапасов                                КАК ВидЗапасов,
		|	ТоварыКомитенту.ВидЗапасов.Организация                    КАК Комиссионер,
		|	ТоварыКомитенту.ВидЗапасов.ВладелецТовара                 КАК Комитент,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры                КАК АналитикаУчетаНоменклатуры,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Номенклатура   КАК Номенклатура,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Назначение     КАК Назначение,
		|	СУММА(ТоварыКомитенту.КоличествоСписаноОстаток)           КАК Списано
		|ПОМЕСТИТЬ ТоварыКомитентуСписываемыеНаКонецПериода
		|ИЗ
		|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Остатки(&КонГраница,
		|		ВидЗапасов.ВладелецТовара ССЫЛКА Справочник.Организации
		|		//&УсловиеОтбора1
		|	) КАК ТоварыКомитенту
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКомитенту.Валюта,
		|	ТоварыКомитенту.ВидЗапасов,
		|	ТоварыКомитенту.ВидЗапасов.Организация,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Характеристика,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры.Назначение
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыКомитенту.КоличествоСписаноОстаток) <> 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Комиссионер,
		|	Комитент,
		|	Номенклатура,
		|	Характеристика,
		|	Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Склад          КАК Комиссионер,
		|	ТоварыПереданные.ВидЗапасов.Организация                    КАК Комитент,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры                КАК АналитикаУчетаНоменклатуры,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Номенклатура   КАК Номенклатура,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Назначение     КАК Назначение,
		|	СУММА(ТоварыПереданные.КоличествоОстаток)                  КАК Списано
		|ПОМЕСТИТЬ ТоварыПереданныеСписываемыеНаКонецПериода
		|ИЗ
		|	РегистрНакопления.ТоварыПереданныеНаКомиссию.Остатки(&КонГраница,
		|		АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.Организации
		|		//&УсловиеОтбора2
		|	) КАК ТоварыПереданные
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Склад,
		|	ТоварыПереданные.ВидЗапасов.Организация,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Характеристика,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Назначение
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыПереданные.КоличествоОстаток) <> 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Комиссионер,
		|	Комитент,
		|	Номенклатура,
		|	Характеристика,
		|	Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		
		ТекстЗапросаТоваровКОформлению = ?(ЗначениеЗаполнено(ТекстЗапросаТоваровКОформлению),
										ТекстЗапросаТоваровКОформлению + ТекстОбъединить,
										ТекстЗапросаТоваровКОформлению);
		
		ТекстЗапросаТоваровКОформлению = ТекстЗапросаТоваровКОформлению + "
		|ВЫБРАТЬ //&КоличествоЗаписей
		|	ТоварыКомитенту.Валюта                     КАК Валюта,
		|	ТоварыКомитенту.Комиссионер                КАК Комиссионер,
		|	ТоварыКомитенту.Комитент                   КАК Комитент,
		|	ТоварыКомитенту.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТоварыКомитенту.ВидЗапасов                 КАК ВидЗапасов,
		|	0                                          КАК Остаток,
		|	ВЫБОР
		|		КОГДА ТоварыКомитенту.Списано <= ТоварыПереданные.Списано
		|			ТОГДА ТоварыКомитенту.Списано
		|		КОГДА ТоварыКомитенту.Списано > ТоварыПереданные.Списано
		|			ТОГДА ТоварыПереданные.Списано
		|	КОНЕЦ                                      КАК Списано,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациямиОСписании) КАК ХозяйственнаяОперация
		|ИЗ
		|	ТоварыКомитентуСписываемыеНаКонецПериода КАК ТоварыКомитенту
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыПереданныеСписываемыеНаКонецПериода КАК ТоварыПереданные
		|		ПО ТоварыКомитенту.Комиссионер = ТоварыПереданные.Комиссионер
		|			И ТоварыКомитенту.Комитент = ТоварыПереданные.Комитент
		|			И ТоварыКомитенту.Номенклатура = ТоварыПереданные.Номенклатура
		|			И ТоварыКомитенту.Характеристика = ТоварыПереданные.Характеристика
		|			И ТоварыКомитенту.Назначение = ТоварыПереданные.Назначение
		|
		|ГДЕ
		|	ВЫБОР
		|		КОГДА ТоварыКомитенту.Списано <= ТоварыПереданные.Списано
		|			ТОГДА ТоварыКомитенту.Списано
		|		КОГДА ТоварыКомитенту.Списано > ТоварыПереданные.Списано
		|			ТОГДА ТоварыПереданные.Списано
		|	КОНЕЦ <> 0
		|";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстЗапросаТоваровКОформлению) Тогда
		Возврат ТекстЗапросаТоваровКОформлению;
	Иначе
		
		ТекстЗапроса = ТекстЗапросаВременнтыхТаблиц + "
		|ВЫБРАТЬ //&КоличествоЗаписей
		|	КОформлению.Валюта                     КАК Валюта,
		|	КОформлению.Комиссионер                КАК Комиссионер,
		|	КОформлению.Комитент                   КАК Комитент,
		|	КОформлению.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	СУММА(КОформлению.Остаток)             КАК КоличествоОстаток,
		|	СУММА(КОформлению.Списано)             КАК КоличествоСписано,
		|	КОформлению.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
		|	ВЫБОР
		|		КОГДА КОформлению.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями)
		|			ТОГДА &ТекстОтчетОПродажах
		|		КОГДА КОформлению.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациямиОСписании)
		|			ТОГДА &ТекстОтчетОСписании
		|	КОНЕЦ                                  КАК ТипДокумента,
		|	ВидыЗапасов.Договор                    КАК Договор,
		|	ВидыЗапасов.ВидЦены                    КАК ВидЦены,
		|	ВидыЗапасов.НалогообложениеНДС         КАК НалогообложениеНДС
		|//&ИмяВременнойТаблицы
		|ИЗ
		|	ТекстЗапросаТоварыКОформлениюНаКонецПериода КАК КОформлению
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
		|		ПО ВидыЗапасов.Ссылка = КОформлению.ВидЗапасов
		|
		|СГРУППИРОВАТЬ ПО
		|	КОформлению.Валюта,
		|	КОформлению.Комиссионер,
		|	КОформлению.Комитент,
		|	КОформлению.АналитикаУчетаНоменклатуры,
		|	КОформлению.ХозяйственнаяОперация,
		|	ВидыЗапасов.Договор,
		|	ВидыЗапасов.ВидЦены,
		|	ВидыЗапасов.НалогообложениеНДС,
		|	ВЫБОР
		|		КОГДА КОформлению.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями)
		|			ТОГДА &ТекстОтчетОПродажах
		|		КОГДА КОформлению.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациямиОСписании)
		|			ТОГДА &ТекстОтчетОСписании
		|	КОНЕЦ";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ТекстЗапросаТоварыКОформлениюНаКонецПериода",
			"(" + ТекстЗапросаТоваровКОформлению + ")");
		
		ТекстУсловияЗапросаТоваровКОформлению = "";
		ТекстУсловияЗапросаТоваровПереданных  = "";
		ТекстУсловияЗапросаУслугКОформлению   = "";
		
		Если ПараметрыЗапроса.Свойство("ЭтоРасчетГиперссылки") Тогда
			
			Если ЗначениеЗаполнено(ПараметрыЗапроса.Комитент) Тогда
				ТекстУсловияЗапросаТоваровКОформлению = "
					|	И ВидЗапасов.ВладелецТовара = &Комитент";
				
				ТекстУсловияЗапросаТоваровПереданных = "
					|	И ВидЗапасов.Организация = &Комитент";
				
				ТекстУсловияЗапросаУслугКОформлению = "
					|	И АналитикаУчетаНоменклатуры.Склад = &Комитент";
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонГраница", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&ИмяВременнойТаблицы", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&КоличествоЗаписей", "ПЕРВЫЕ 1");
			
		Иначе
			
			ТекстЗапросаВременнтыхТаблиц = СтрЗаменить(ТекстЗапросаВременнтыхТаблиц, "&КонГраница", "&НачГраница");
			ТекстЗапросаВременнтыхТаблиц = СтрЗаменить(ТекстЗапросаВременнтыхТаблиц, "НаКонецПериода", "НаНачалоПериода");
			
			ТекстЗапроса = ТекстЗапроса + ТекстРазделить + ТекстЗапросаВременнтыхТаблиц + "
			|ВЫБРАТЬ
			|	КОформлению.Валюта                     КАК Валюта,
			|	КОформлению.Комиссионер                КАК Комиссионер,
			|	КОформлению.Комитент                   КАК Комитент,
			|	КОформлению.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			|	СУММА(КОформлению.Остаток)             КАК КоличествоОстаток,
			|	СУММА(КОформлению.Списано)             КАК КоличествоСписано,
			|	КОформлению.ХозяйственнаяОперация      КАК ХозяйственнаяОперация
			|ПОМЕСТИТЬ ТоварыКОформлениюНаНачалоПериода
			|ИЗ
			|	ТекстЗапросаТоварыКОформлениюНаНачалоПериода КАК КОформлению
			|
			|СГРУППИРОВАТЬ ПО
			|	КОформлению.Валюта,
			|	КОформлению.Комиссионер,
			|	КОформлению.Комитент,
			|	КОформлению.АналитикаУчетаНоменклатуры,
			|	КОформлению.ХозяйственнаяОперация
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Валюта,
			|	Комиссионер,
			|	Комитент,
			|	АналитикаУчетаНоменклатуры,
			|	ХозяйственнаяОперация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОстатокТоваровНаКонецПериода.Валюта КАК Валюта,
			|	ОстатокТоваровНаКонецПериода.Комиссионер КАК Комиссионер,
			|	ОстатокТоваровНаКонецПериода.Комитент КАК Комитент,
			|	СУММА(ОстатокТоваровНаКонецПериода.КоличествоОстаток) - СУММА(ЕСТЬNULL(ОстатокТоваровНаНачалоПериода.КоличествоОстаток, 0)) КАК КоличествоОстаток,
			|	СУММА(ОстатокТоваровНаКонецПериода.КоличествоСписано) - СУММА(ЕСТЬNULL(ОстатокТоваровНаНачалоПериода.КоличествоСписано, 0)) КАК КоличествоСписано,
			|	ОстатокТоваровНаКонецПериода.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	ОстатокТоваровНаКонецПериода.ТипДокумента КАК ТипДокумента,
			|	ОстатокТоваровНаКонецПериода.Договор КАК Договор,
			|	ОстатокТоваровНаКонецПериода.ВидЦены КАК ВидЦены,
			|	ОстатокТоваровНаКонецПериода.НалогообложениеНДС КАК НалогообложениеНДС
			|ИЗ
			|	ТоварыКОформлениюНаКонецПериода КАК ОстатокТоваровНаКонецПериода
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКОформлениюНаНачалоПериода КАК ОстатокТоваровНаНачалоПериода
			|		ПО ОстатокТоваровНаКонецПериода.Валюта = ОстатокТоваровНаНачалоПериода.Валюта
			|			И ОстатокТоваровНаКонецПериода.Комиссионер = ОстатокТоваровНаНачалоПериода.Комиссионер
			|			И ОстатокТоваровНаКонецПериода.Комитент = ОстатокТоваровНаНачалоПериода.Комитент
			|			И ОстатокТоваровНаКонецПериода.АналитикаУчетаНоменклатуры = ОстатокТоваровНаНачалоПериода.АналитикаУчетаНоменклатуры
			|			И ОстатокТоваровНаКонецПериода.ХозяйственнаяОперация = ОстатокТоваровНаНачалоПериода.ХозяйственнаяОперация
			|
			|ГДЕ
			|	ОстатокТоваровНаКонецПериода.КоличествоОстаток - ЕСТЬNULL(ОстатокТоваровНаНачалоПериода.КоличествоОстаток, 0) > 0
			|	ИЛИ ОстатокТоваровНаКонецПериода.КоличествоСписано - ЕСТЬNULL(ОстатокТоваровНаНачалоПериода.КоличествоСписано, 0) > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ОстатокТоваровНаКонецПериода.Валюта,
			|	ОстатокТоваровНаКонецПериода.Комиссионер,
			|	ОстатокТоваровНаКонецПериода.Комитент,
			|	ОстатокТоваровНаКонецПериода.ХозяйственнаяОперация,
			|	ОстатокТоваровНаКонецПериода.ТипДокумента,
			|	ОстатокТоваровНаКонецПериода.Договор,
			|	ОстатокТоваровНаКонецПериода.ВидЦены,
			|	ОстатокТоваровНаКонецПериода.НалогообложениеНДС";
			
			ТекстПоместить = "ПОМЕСТИТЬ ТоварыКОформлениюНаКонецПериода";
			ТекстЗапросаТоваровКОформлению = СтрЗаменить(ТекстЗапросаТоваровКОформлению, "&КонГраница", "&НачГраница");
			ТекстЗапросаТоваровКОформлению = СтрЗаменить(ТекстЗапросаТоваровКОформлению, "НаКонецПериода", "НаНачалоПериода");
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&ИмяВременнойТаблицы", ТекстПоместить);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
				"ТекстЗапросаТоварыКОформлениюНаНачалоПериода",
				"(" + ТекстЗапросаТоваровКОформлению + ")");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&КоличествоЗаписей", "");
			
			Если ПараметрыЗапроса.Свойство("Комиссионер")
				И ЗначениеЗаполнено(ПараметрыЗапроса.Комиссионер)
				И ЗначениеЗаполнено(ПараметрыЗапроса.Комитент)
				И ПараметрыЗапроса.Комиссионер = ПараметрыЗапроса.Комитент Тогда
				
				// Условия формирования списка при открытии из обработки "ОпперацииЗакрытияМесяца".
				
				ТекстУсловияЗапросаТоваровКОформлению = "
					|	И (ВидЗапасов.ВладелецТовара = &Комитент
					|		ИЛИ ВидЗапасов.Организация = &Комиссионер)";
				
				ТекстУсловияЗапросаТоваровПереданных = "
					|	И (ВидЗапасов.Организация = &Комитент
					|		ИЛИ АналитикаУчетаНоменклатуры.Склад = &Комиссионер)";
				
				ТекстУсловияЗапросаУслугКОформлению = "
					|	И (АналитикаУчетаНоменклатуры.Склад = &Комитент
					|		ИЛИ Организация = &Комиссионер)";
				
			Иначе
				
				Если ЗначениеЗаполнено(ПараметрыЗапроса.Комитент) Тогда
					УсловиеЗапросаТоваровКОформлению = "
						|	И &Комитент В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), ВидЗапасов.ВладелецТовара)";
					
					ТекстУсловияЗапросаТоваровКОформлению = ТекстУсловияЗапросаТоваровКОформлению + УсловиеЗапросаТоваровКОформлению;
					
					УсловиеЗапросаТоваровПереданных = "
						|	И &Комитент В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), ВидЗапасов.Организация)";
					
					ТекстУсловияЗапросаТоваровПереданных = ТекстУсловияЗапросаТоваровПереданных + УсловиеЗапросаТоваровПереданных;
					
					УсловиеЗапросаУслугКОформлению = "
						|	И &Комитент В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), АналитикаУчетаНоменклатуры.Склад)";
					
					ТекстУсловияЗапросаУслугКОформлению = ТекстУсловияЗапросаУслугКОформлению + УсловиеЗапросаУслугКОформлению;
				КонецЕсли;
				
				Если ПараметрыЗапроса.Свойство("Комиссионер")
					И ЗначениеЗаполнено(ПараметрыЗапроса.Комиссионер) Тогда
					
					УсловиеЗапросаТоваровКОформлению = "
						|	И &Комиссионер В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), ВидЗапасов.Организация)";
					
					ТекстУсловияЗапросаТоваровКОформлению = ТекстУсловияЗапросаТоваровКОформлению + УсловиеЗапросаТоваровКОформлению;
					
					УсловиеЗапросаТоваровПереданных = "
						|	И &Комиссионер В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), АналитикаУчетаНоменклатуры.Склад)";
					
					ТекстУсловияЗапросаТоваровПереданных = ТекстУсловияЗапросаТоваровПереданных + УсловиеЗапросаТоваровПереданных;
					
					УсловиеЗапросаУслугКОформлению = "
						|	И &Комиссионер В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), Организация)";
					
					ТекстУсловияЗапросаУслугКОформлению = ТекстУсловияЗапросаУслугКОформлению + УсловиеЗапросаУслугКОформлению;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&УсловиеОтбора1",
			?(ЗначениеЗаполнено(ТекстУсловияЗапросаТоваровКОформлению), ТекстУсловияЗапросаТоваровКОформлению, ""));
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&УсловиеОтбора2",
			?(ЗначениеЗаполнено(ТекстУсловияЗапросаТоваровПереданных), ТекстУсловияЗапросаТоваровПереданных, ""));
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&УсловиеОтбора3",
			?(ЗначениеЗаполнено(ТекстУсловияЗапросаУслугКОформлению), ТекстУсловияЗапросаУслугКОформлению, ""));
		
		Возврат ТекстЗапроса;
		
	КонецЕсли;
	
КонецФункции

// Возвращает текст гиперссылки перехода из журнала документов в рабочее место оформления отчетов по комиссии.
//
// Параметры:
//	Параметры - Структура - параметры формирования текста гиперссылки.
//
// ВозвращаемоеЗначение:
//	ФорматированнаяСтрока, Неопределено - текст гиперссылки перехода в рабочее место оформления отчетов по комиссии.
//
Функция СформироватьГиперссылкуКОформлению(Параметры) Экспорт
	
	ХозяйственныеОперацииИДокументы = Параметры.ХозяйственныеОперацииИДокументы;
	
	Отбор = Новый Структура("Отбор, КлючНазначенияИспользования", Истина, "ОтчетПоКомиссииМеждуОрганизациями");
	ХозяйственныеОперацииОтчетов = ХозяйственныеОперацииИДокументы.НайтиСтроки(Отбор);
	
	Если ХозяйственныеОперацииОтчетов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отбор = Новый Структура("Отбор, ПолноеИмяДокумента", Истина, "Документ.ОтчетПоКомиссииМеждуОрганизациями");
	ОформитьПоОтчетамКомиссии = ХозяйственныеОперацииИДокументы.НайтиСтроки(Отбор).Количество() > 0;
	
	Отбор = Новый Структура("Отбор, ПолноеИмяДокумента", Истина, "Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании");
	ОтобратьПоОтчетамКомиссииОСписании = ХозяйственныеОперацииИДокументы.НайтиСтроки(Отбор).Количество() > 0;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Комитент",                           Параметры.Организация);
	ПараметрыЗапроса.Вставить("ЭтоРасчетГиперссылки",               Параметры.ЭтоРасчетГиперссылки);
	ПараметрыЗапроса.Вставить("ОформитьПоОтчетамКомиссии",          ОформитьПоОтчетамКомиссии);
	ПараметрыЗапроса.Вставить("ОтобратьПоОтчетамКомиссииОСписании", ОтобратьПоОтчетамКомиссииОСписании);
	
	ТекстЗапроса = ТекстЗапросаОформляемыеОтчетыПоКомиссии(ПараметрыЗапроса);
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	ТекстГиперссылки    = НСтр("ru = 'Отчеты по комиссии'");
	ТекстОтчетОПродажах = НСтр("ru='Отчет о продажах'");
	ТекстОтчетОСписании = НСтр("ru='Отчет о списании'");
	
	Запрос.УстановитьПараметр("Комитент",            Параметры.Организация);
	Запрос.УстановитьПараметр("ТекстОтчетОПродажах", ТекстОтчетОПродажах);
	Запрос.УстановитьПараметр("ТекстОтчетОСписании", ТекстОтчетОСписании);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Новый ФорматированнаяСтрока(ТекстГиперссылки, , , ,
			"Обработка.ЖурналДокументовИнтеркампани.Форма.РабочееМестоОтчетыПоКомиссии");
	Иначе
		Возврат Новый ФорматированнаяСтрока(ТекстГиперссылки, , ЦветаСтиля.НезаполненноеПолеТаблицы, ,
			"Обработка.ЖурналДокументовИнтеркампани.Форма.РабочееМестоОтчетыПоКомиссии");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриОпределенииКомандПодключенныхКОбъекту(Команды) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
